#+TITLE: Doom Emacs Configuration

** org-capture

#+begin_src elisp
(after! org
  (setq
   org-capture-templates
   (quote
    (("r" "refile" entry
      (file "~/org/refile.org")
      "* ToDo %?
")
     ("z" "bugz" entry
      (file+headline "~/org/bugz.org" "bugz!")
      "* ToDo %?
%a")))))

#+end_src

#+RESULTS:
| r | refile | entry | (file ~/org/refile.org)              | * ToDo %? |
| z | bugz   | entry | (file+headline ~/org/bugz.org bugz!) | * ToDo %? |

** ToDos

#+begin_src elisp

(after! org
  :config
   (setq-default org-todo-keywords '((sequence "ToDo(t)" "Next(n)" "Blocked(b@)" "|" "Done(d!)")))
   (setq org-todo-keyword-faces (quote (("ToDo" :foreground "#2E2E8B8B5757" :weight bold)
                                        ("Done" :foreground "black" :weight bold)
                                        ("Blocked" :foreground "yellow4" :weight bold)
                                        ("Next" :foreground "orange red" :weight bold))))
   (setq org-agenda-category-icon-alist
        `(("life" ,(list (all-the-icons-material "home" :height 1)) nil nil :ascent center)
          ("garden" ,(list (all-the-icons-material "home" :height 1)) nil nil :ascent center)
          ("sys" ,(list (all-the-icons-material "settings" :height 1)) nil nil :ascent center)
          ("bugz" ,(list (all-the-icons-material "flag" :height 1)) nil nil :ascent center)
          ("emacs" ,(list (all-the-icons-material "edit" :height 1)) nil nil :ascent center)
          ("repo" ,(list (all-the-icons-material "ac_unit" :height 1)) nil nil :ascent center)
          ("ib" ,(list (all-the-icons-material "account_balance" :height 1)) nil nil :ascent center)
          ("fe" ,(list (all-the-icons-material "local_atm" :height 1)) nil nil :ascent center)
          ("auspol" ,(list (all-the-icons-material "format_align_left" :height 1)) nil nil :ascent center)
          ("drafts" ,(list (all-the-icons-material "format_align_left" :height 1)) nil nil :ascent center)
          ("iqfeed" ,(list (all-the-icons-material "account_balance" :height 1)) nil nil :ascent center)
          ("haskell" ,(list (all-the-icons-material "event_available" :height 1)) nil nil :ascent center)
          ("act" ,(list (all-the-icons-material "event_available" :height 1)) nil nil :ascent center)
          ("refile" ,(list (all-the-icons-material "move_to_inbox" :height 1)) nil nil :ascent center)))
)

#+end_src

#+RESULTS:
| life    | () | nil | nil | :ascent | center |
| sys     | () | nil | nil | :ascent | center |
| bugz    | () | nil | nil | :ascent | center |
| emacs   | () | nil | nil | :ascent | center |
| repo    | () | nil | nil | :ascent | center |
| ib      | () | nil | nil | :ascent | center |
| fe      | () | nil | nil | :ascent | center |
| drafts  | () | nil | nil | :ascent | center |
| iqfeed  | () | nil | nil | :ascent | center |
| haskell | () | nil | nil | :ascent | center |
| refile  | () | nil | nil | :ascent | center |

